/*
 * -----------------------------------------
 *      非連結グラフの探索（深さ優先）     *
 * -----------------------------------------
 */
#include <stdio.h>

#define N 8                            // 点の数

int a[N+1][N+1]={{0,0,0,0,0,0,0,0,0},  // 隣接行列
                 {0,0,1,1,0,0,0,0,0},
                 {0,1,0,1,1,0,0,0,0},
                 {0,1,1,0,0,1,0,0,0},
                 {0,0,1,0,0,1,0,0,0},
                 {0,0,0,1,1,0,0,0,0},
                 {0,0,0,0,0,0,0,1,1},
                 {0,0,0,0,0,0,1,0,1},
                 {0,0,0,0,0,0,1,1,0}};
int v[N+1];                            // 訪問フラグ

void visit(int);

void main(void)
{
    int i,count=1;    // 連結成分のカウント用

    for (i=1;i<=N;i++)
        v[i]=0;
    for (i=1;i<=N;i++){
        if (v[i]!=1){
            printf("%d :",count++);
            visit(i);
            printf("\n");
        }
    }
}
void visit(int i)
{
    int j;

    printf("%d ",i);
    v[i]=1;
    for (j=1;j<=N;j++){
        if (a[i][j]==1 && v[j]==0)
            visit(j);
    }
}
